#language: ru

Функционал: Поиск на Авито

  Сценарий:  Найдём самые дорогие принтеры на Авито
    Пусть открыт ресурс Авито
    И в выпадающием списке категорий выбрана Оргтехника_и_расходники
    И в поле поиска введено значение принтер
    Тогда кликнуть по выпадающему списку региона
    Тогда в поле региона введено значение Владивосток
    И нажата кнопка показать объявления
    Тогда открыласть страница результатов по запросу принтер
    И активирован чекбокс только с фотографией
    И в выпадающем списке сортировки выбрано Дороже
    И в консоль выведено название и цена 3 первых товаров


  # Проверка на то, что открыта конкретная страница, как я понял, классически, осуществляется через Assert.assertEquals()
  # в котором сравниваются две ссылки. Одна, которая получена от драйвера и другая, которая получена и введена руками.
  # Я сделал немного по другому. Из шага на проверку страницы берется параметр в виде строки,
  # переводиться в UTF-16 и проверяется, содержит ли ссылка от драйвера эту строку.
  # Поскольку адресная строка Авито содержит параметр, введённый в строке поиска - это работает.
  # Таким образом, в сценарии можно менять только параметры введенного в поле значения и параметр страницы, которая проверяется.

