#language: ru

Функционал: Поиск на Авито

  Сценарий:  Найдём самые дорогие принтеры на Авито
    Пусть открыт ресурс Авито
    И в выпадающием списке категорий выбрана Оргтехника_и_расходники
    И в поле поиска введено значение принтер
    Тогда кликнуть по выпадающему списку региона
    Тогда в поле региона введено значение Владивосток
    И нажата кнопка показать объявления
    Тогда открыласть страница результатов по запросу принтер
    И активирован чекбокс только с фотографией
    И в выпадающем списке сортировки выбрано Дороже
    И в консоль выведено название и цена 3 первых товаров